[{"cpc_class":"G05F3/30","early_count":377,"late_count":100,"pct_change":-73.5,"class_name":"Non-retroactive systems for regulating electric variables by using an uncontrolled element, or an uncontrolled combination of elements, such element or such combination having self-regulating properties -Regulating voltage or current-wherein the variable is DC-using uncontrolled devices with non-linear characteristics-being semiconductor devices-using diode- transistor combinations -Regulators using the difference between the base-emitter voltages of two bipolar transistors operating at different current densities ","direction":"declining"},{"cpc_class":"B24B37/013","early_count":402,"late_count":105,"pct_change":-73.9,"class_name":"Lapping machines or devices; Accessories -Control means for lapping machines or devices-Devices or means for detecting lapping completion","direction":"declining"},{"cpc_class":"G06Q30/06","early_count":1888,"late_count":481,"pct_change":-74.5,"class_name":"Commerce-Buying, selling or leasing transactions","direction":"declining"},{"cpc_class":"G07F17/32","early_count":989,"late_count":243,"pct_change":-75.4,"class_name":"Coin-freed apparatus for hiring articles; Coin-freed facilities or services-for games, toys, sports, or amusements","direction":"declining"},{"cpc_class":"G06F30/30","early_count":788,"late_count":194,"pct_change":-75.4,"class_name":"Computer-aided design [CAD]-Circuit design","direction":"declining"},{"cpc_class":"H01L21/76843","early_count":741,"late_count":171,"pct_change":-76.9,"class_name":"Processes or apparatus adapted for the manufacture or treatment of semiconductor or solid state devices or of parts thereof-Manufacture or treatment of devices consisting of a plurality of solid state components formed in or on a common substrate or of parts thereof; Manufacture of integrated circuit devices or of parts thereof -Manufacture of specific parts of devices defined in group H01L21/70 -Applying interconnections to be used for carrying current between separate components within a device ; comprising conductors and dielectrics-characterised by the formation and the after-treatment of the conductors -Barrier, adhesion or liner layers-formed in openings in a dielectric","direction":"declining"},{"cpc_class":"G02B26/0841","early_count":597,"late_count":137,"pct_change":-77.1,"class_name":"Optical devices or arrangements for the control of light using movable or deformable optical elements -for controlling the direction of light -by means of one or more reflecting elements-the reflecting element being a micromechanical device, e.g. a MEMS mirror, DMD -the reflecting element being moved or deformed by electrostatic means","direction":"declining"},{"cpc_class":"H10B12/09","early_count":465,"late_count":102,"pct_change":-78.1,"class_name":null,"direction":"declining"},{"cpc_class":"H01L24/85","early_count":615,"late_count":130,"pct_change":-78.9,"class_name":"Arrangements for connecting or disconnecting semiconductor or solid-state bodies; Methods or apparatus related thereto-Methods for connecting semiconductor or other solid state bodies using means for bonding being attached to, or being formed on, the surface to be connected-using a wire connector ","direction":"declining"},{"cpc_class":"G02F1/133555","early_count":522,"late_count":110,"pct_change":-78.9,"class_name":"Devices or arrangements for the control of the intensity, colour, phase, polarisation or direction of light arriving from an independent light source, e.g. switching, gating or modulating; Non-linear optics-for the control of the intensity, phase, polarisation or colour  -based on liquid crystals, e.g. single liquid crystal display cells-Constructional arrangements; Operation of liquid crystal cells; Circuit arrangements -Constructional arrangements; ; Manufacturing methods-Structural association of cells with optical devices, e.g. polarisers or reflectors-Reflecting elements -Transflectors","direction":"declining"},{"cpc_class":"H10B41/30","early_count":1503,"late_count":300,"pct_change":-80.0,"class_name":null,"direction":"declining"},{"cpc_class":"H04L47/10","early_count":1151,"late_count":226,"pct_change":-80.4,"class_name":"Traffic control in data switching networks -Flow control; Congestion control","direction":"declining"},{"cpc_class":"H04L45/00","early_count":1157,"late_count":207,"pct_change":-82.1,"class_name":"Routing or path finding of packets in data switching networks ","direction":"declining"},{"cpc_class":"C07H21/00","early_count":684,"late_count":115,"pct_change":-83.2,"class_name":"Compounds containing two or more mononucleotide units having separate phosphate or polyphosphate groups linked by saccharide radicals of nucleoside groups, e.g. nucleic acids","direction":"declining"},{"cpc_class":"G06F16/10","early_count":689,"late_count":111,"pct_change":-83.9,"class_name":"Information retrieval; Database structures therefor; File system structures therefor-File systems; File servers","direction":"declining"},{"cpc_class":"G06F3/0412","early_count":101,"late_count":3838,"pct_change":3700.0,"class_name":"Input arrangements for transferring data to be processed into a form capable of being handled by the computer; Output arrangements for transferring data from processing unit to output unit, e.g. interface arrangements-Input arrangements or combined input and output arrangements for interaction between user and computer -Arrangements for converting the position or the displacement of a member into a coded form-Digitisers, e.g. for touch screens or touch pads, characterised by the transducing means-Digitisers structurally integrated in a display","direction":"growing"},{"cpc_class":"H04W72/23","early_count":125,"late_count":3856,"pct_change":2984.8,"class_name":"Local resource management-Control channels or signalling for resource management-in the downlink direction of a wireless link, i.e. towards a terminal","direction":"growing"},{"cpc_class":"G06N20/00","early_count":140,"late_count":3560,"pct_change":2442.9,"class_name":"Machine learning","direction":"growing"},{"cpc_class":"G06F3/017","early_count":125,"late_count":2824,"pct_change":2159.2,"class_name":"Input arrangements for transferring data to be processed into a form capable of being handled by the computer; Output arrangements for transferring data from processing unit to output unit, e.g. interface arrangements-Input arrangements or combined input and output arrangements for interaction between user and computer -Gesture based interaction, e.g. based on a set of recognized hand gestures ","direction":"growing"},{"cpc_class":"H04L63/20","early_count":129,"late_count":2503,"pct_change":1840.3,"class_name":"Network architectures or network communication protocols for network security -for managing network security; network security policies in general ","direction":"growing"},{"cpc_class":"G06F3/013","early_count":105,"late_count":2018,"pct_change":1821.9,"class_name":"Input arrangements for transferring data to be processed into a form capable of being handled by the computer; Output arrangements for transferring data from processing unit to output unit, e.g. interface arrangements-Input arrangements or combined input and output arrangements for interaction between user and computer -Arrangements for interaction with the human body, e.g. for user immersion in virtual reality -Eye tracking input arrangements ","direction":"growing"},{"cpc_class":"H04W24/08","early_count":112,"late_count":1825,"pct_change":1529.5,"class_name":"Supervisory, monitoring or testing arrangements-Testing, ; supervising or monitoring;  using real traffic","direction":"growing"},{"cpc_class":"G02B27/0172","early_count":194,"late_count":3053,"pct_change":1473.7,"class_name":"Optical systems or apparatus not provided for by any of the groups G02B1/00 - G02B26/00, G02B30/00-Head-up displays-Head mounted-characterised by optical features","direction":"growing"},{"cpc_class":"G06F3/04847","early_count":104,"late_count":1621,"pct_change":1458.7,"class_name":"Input arrangements for transferring data to be processed into a form capable of being handled by the computer; Output arrangements for transferring data from processing unit to output unit, e.g. interface arrangements-Input arrangements or combined input and output arrangements for interaction between user and computer -Interaction techniques based on graphical user interfaces [GUI]-for the control of specific functions or operations, e.g. selecting or manipulating an object, an image or a displayed text element, setting a parameter value or selecting a range-Interaction techniques to control parameter settings, e.g. interaction with sliders or dials","direction":"growing"},{"cpc_class":"G06F21/6245","early_count":130,"late_count":1985,"pct_change":1426.9,"class_name":"Security arrangements for protecting computers, components thereof, programs or data against unauthorised activity-Protecting data-Protecting access to data via a platform, e.g. using keys or access control rules-to a system of files or objects, e.g. local or distributed file system or database-Protecting personal data, e.g. for financial or medical purposes","direction":"growing"},{"cpc_class":"G06F40/30","early_count":144,"late_count":2086,"pct_change":1348.6,"class_name":"Handling natural language data -Semantic analysis","direction":"growing"},{"cpc_class":"H04W24/02","early_count":171,"late_count":2404,"pct_change":1305.8,"class_name":"Supervisory, monitoring or testing arrangements-Arrangements for optimising operational condition","direction":"growing"},{"cpc_class":"G06F21/32","early_count":197,"late_count":2579,"pct_change":1209.1,"class_name":"Security arrangements for protecting computers, components thereof, programs or data against unauthorised activity-Authentication, i.e. establishing the identity or authorisation of security principals-User authentication-using biometric data, e.g. fingerprints, iris scans or voiceprints","direction":"growing"},{"cpc_class":"G06F3/061","early_count":163,"late_count":2125,"pct_change":1203.7,"class_name":"Input arrangements for transferring data to be processed into a form capable of being handled by the computer; Output arrangements for transferring data from processing unit to output unit, e.g. interface arrangements-Digital input from, or digital output to, record carriers ; , e.g. RAID, emulated record carriers or networked record carriers-Interfaces specially adapted for storage systems-specifically adapted to achieve a particular effect-Improving I/O performance","direction":"growing"},{"cpc_class":"H10K59/131","early_count":139,"late_count":1672,"pct_change":1102.9,"class_name":"Integrated devices, or assemblies of multiple devices, comprising at least one organic light-emitting element covered by group H10K50/00-OLED displays-Active-matrix OLED [AMOLED] displays-Interconnections, e.g. wiring lines or terminals","direction":"growing"}]